Terraform plan in __.__
<details>
  <summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.catalog_next.module.redis.aws_elasticache_replication_group.redis[0] must be replaced
-/+ resource "aws_elasticache_replication_group" "redis" {
      + apply_immediately              = (known after apply)
      ~ arn                            = "arn:aws:elasticache:us-east-1:587807691409:replicationgroup:rep-sandbox-catalog-next" -> (known after apply)
      ~ at_rest_encryption_enabled     = false -> (known after apply)
      ~ auth_token                     = (sensitive value) # forces replacement
      ~ cluster_enabled                = false -> (known after apply)
      + configuration_endpoint_address = (known after apply)
      ~ engine_version_actual          = "5.0.6" -> (known after apply)
      + global_replication_group_id    = (known after apply)
      ~ id                             = "************************" -> (known after apply)
      ~ maintenance_window             = "thu:07:00-thu:08:00" -> (known after apply)
      ~ member_clusters                = [
          - "rep-sandbox-catalog-next-001",
        ] -> (known after apply)
      ~ primary_endpoint_address       = "master.rep-sandbox-catalog-next.5kspe7.use1.cache.amazonaws.com" -> (known after apply)
      ~ reader_endpoint_address        = "replica.rep-sandbox-catalog-next.5kspe7.use1.cache.amazonaws.com" -> (known after apply)
      ~ security_group_names           = [] -> (known after apply)
      - snapshot_retention_limit       = 0 -> null
      ~ snapshot_window                = "10:00-11:00" -> (known after apply)
        tags                           = {
            "env"  = "sandbox"
            "name" = "catalog-next"
        }
        # (15 unchanged attributes hidden)

      ~ cluster_mode {
          ~ num_node_groups         = 1 -> (known after apply)
          ~ replicas_per_node_group = 0 -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ catalog_next_redis_cache_nodes = [
      - "master.rep-sandbox-catalog-next.5kspe7.use1.cache.amazonaws.com",
      + (known after apply),
    ]
  # Warning: this attribute value will be marked as sensitive and will not
  # display in UI output after applying this change.
  ~ catalog_next_redis_password    = (sensitive value)
```
</details>

Plan generated in [plan #49](https://github.com/GSA/datagov-infrastructure-live/actions/runs/1340397561)